# Мой основной мотив в поиске работы
# С первых своих шагов в карьере всегда уделял внимание развитию в организации или команде
# культуры использования современных информационных технологий.
# Лично занимаюсь вопросами функционирования сайтов и приложений в режиме full-stack.
# Настолько привык к этому, что хочу теперь непосредственно заниматься программированием
# и работой с Заказчиками, программистами, технологами.
# Программирование изучаю самостоятельно, разбирая код и добавляя множество сопутствующих знаний.


class MyEducation:

    def neti(self):
        # Новосибирский электротехнический институт
        pass  # Физико-технический факультет

    def mupk(self):
        # Московский университет потребкооперации
        pass  # Экономика и маркетинг в торговле и бизнесе

    def foreign_languages(self):
        english, deutsch = 'уверенный пользователь', 'свободное владение'
        pass  # Ведение продолжительных переговоров


class ExperienceInTheITsector:  # Опыт работы в секторе IT
    def full_stack(self):
        web_designer = ['HTML', 'CSS', 'Bootstrap', 'SQL',
                        'Git', 'Python + Django + Tkinter']
        # Опыт более 15 лет. Статус: Junior для Python, но хочу бОльшего
        return web_designer

    def Management(self):  # Руководство созданием сайтов (платформ)
        dev_tech_specifications = ['контроль исполнения', 'взаимодействие с подразделениями IT',
                                   'следование правилам Agile', 'переговоры с Заказчиком',
                                   'сопровождение контрактов']
        # Опыт более 10 лет Уверенный и эффективный организатор
        return dev_tech_specifications


class ExpInProjectManagementAdministration:  # Опыт работы в управлении проектами, администрировании

    def commercial_sector(self):  # Коммерческий сектор
        сom_manager = ['проекты по созданию бизнес-юнитов с нуля',
                       'анализ бизнес-процессов', 'создание отделов маркетинга и продаж',
                       'управление организациями с широкой региональной сетью',
                       'работа с ТОП менеджментом (B2B)', 'массовым клиентом (B2C)']  # более 15 лет
        return сom_manager

    def non_commercial_sector(self):  # Некоммерческий сектор
        nco_manager = ['организация образовательных, спортивных, волонтерских проектов',
                       'работа с органами власти', 'реализация учебных проектов']  # с 2004 года
        return nco_manager

    def My_places_of_work(self):  # Места работы
        firms = ['ЗАО СПУТНИК (директор по развитию)', 'ШМ Арсенал (начальник курса)',
                 'Российская ассоциация маркетинга (исп. директор)',
                 'Федерация санного спорта России (исп. директор)',
                 'Сервон (начальник отдела продаж)',
                 'Рустранс (начальник отдела маркетинга)',
                 'РосНародСпорт (руководитель НКО)',
                 ]
        # Смостоятельно везде настраивал сайты организаций


class SoftSkills:
    def my_skills(self):
        pass
        # Я работаю одновременно на стороне Исполнителя и Заказчика, понимаю как начальные
        # промежуточные, так и конечные стадии работы с продуктом (комплексный подход).
        # Считаю главным – уважение результатов труда.
